Revit 2024 API
Gradient.GradientNoiseLevels Property
 The property labeled "Levels" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GradientNoiseLevels { get; }
Visual Basic
Public Shared ReadOnly Property GradientNoiseLevels As String
	Get
Visual C++
public:
static property String^ GradientNoiseLevels {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "1, 10".
See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace